zihui89w/leigun/modules/softgun/controllers/nuc970/nuc970_uart.c
typedef struct IMX_Uart {
	BusDevice bdev;
	Clock_t *in_clk;	/* from crm module */
	Clock_t *refclk;
	char *name;
	UartPort *port;
	uint16_t ucr1, ucr2, ucr3, ucr4;
	uint16_t ufcr;
	uint16_t usr1;
	uint16_t usr2;
	uint16_t uesc;
	uint16_t utim;
	uint16_t ubir;
	uint16_t ubmr;
	uint16_t ubrc;
	uint16_t onems;
	uint16_t uts;

	UartChar txfifo[TX_FIFO_SIZE];
	uint64_t txfifo_wp;
	uint64_t txfifo_releasep;
	uint64_t txfifo_rp;
	int nsecs_per_char;

	uint16_t rxfifo[RX_FIFO_SIZE];
	uint64_t rxfifo_wp;
	uint64_t rxfifo_rp;

	int interrupt_posted;
	SigNode *irqNode;
	SigNode *rxDmaReqNode;
	SigNode *txDmaReqNode;
	CycleTimer baudTimer;
} IMX_Uart;

static void
update_interrupts(IMX_Uart * iuart)
{
	uint16_t rrdyen = iuart->ucr1 & UCR1_RRDYEN;
	uint16_t trdyen = iuart->ucr1 & UCR1_TRDYEN;
	uint16_t txmptyen = iuart->ucr1 & UCR1_TXMPTYEN;
	int interrupt = 0;
	int tx_room = TX_FIFO_ROOM(iuart);
	int rx_fill = RX_FIFO_COUNT(iuart);
	int txtl = (iuart->ufcr & UFCR_TXTL_MASK) >> UFCR_TXTL_SHIFT;
	int rxtl = (iuart->ufcr & UFCR_RXTL_MASK) >> UFCR_RXTL_SHIFT;
	if (trdyen && (tx_room >= txtl)) {
		interrupt = 1;
	}
	/* does it also trigger an interrupt when 0 characters are received  ? */
	if (rrdyen && (rx_fill >= rxtl)) {
		interrupt = 1;
	}
	if (txmptyen && (TX_FIFO_COUNT(iuart) == 0)) {
		interrupt = 1;
	}
	if (interrupt) {
		if (!iuart->interrupt_posted) {
			SigNode_Set(iuart->irqNode, SIG_LOW);
			iuart->interrupt_posted = 1;
		}
	} else {
		if (iuart->interrupt_posted) {
			SigNode_Set(iuart->irqNode, SIG_HIGH);
			iuart->interrupt_posted = 0;
		}
	}
}

static void
update_refclk(IMX_Uart * iuart)
{
	int rfdiv = (iuart->ufcr & UFCR_RFDIV_MASK) >> UFCR_RFDIV_SHIFT;
	int divider = 1;
	if (rfdiv < 6) {
		divider = (rfdiv ^ 7) - 1;
	} else if (rfdiv == 5) {
		divider = 7;
	} else {
		fprintf(stderr, "IMXUart: Illegal rfdiv value in UFCR register\n");
	}
	Clock_MakeDerived(iuart->refclk, iuart->in_clk, 1, /*divider*/1);
	//fprintf(stderr,"Clock: %f, ref %f\n",Clock_Freq(iuart->in_clk),Clock_Freq(iuart->refclk));

}

/*
 * ------------------------------------------------------------------------
 * DMA request lines
 * ------------------------------------------------------------------------
 */

static void
update_txdma(IMX_Uart * iuart)
{
	int txdmaen = !!(iuart->ucr1 & UCR1_TXDMAEN);
	int txtl = (iuart->ufcr & UFCR_TXTL_MASK) >> UFCR_TXTL_SHIFT;
	if (txdmaen && (TX_FIFO_ROOM(iuart) >= txtl)) {
		SigNode_Set(iuart->txDmaReqNode, SIG_LOW);
	} else {
		SigNode_Set(iuart->txDmaReqNode, SIG_HIGH);
	}
}

static void
update_rxdma(IMX_Uart * iuart)
{
	int rxdmaen = !!(iuart->ucr1 & UCR1_RXDMAEN);
	int rxtl = (iuart->ufcr & UFCR_RXTL_MASK) >> UFCR_RXTL_SHIFT;
	if (rxtl && rxdmaen && (RX_FIFO_COUNT(iuart) >= rxtl)) {
		SigNode_Set(iuart->rxDmaReqNode, SIG_LOW);
	} else {
		SigNode_Set(iuart->rxDmaReqNode, SIG_HIGH);
	}
}

/*
 * ------------------------------------
 * Put one byte to the rxfifo
 * ------------------------------------
 */
static inline void
serial_rx_char(IMX_Uart * iuart, UartChar c)
{
	iuart->rxfifo[RX_FIFO_WIDX(iuart)] = c | URR_CHARRDY;
	iuart->rxfifo_wp++;
	return;
}

/*
 * --------------------------------------------------------------------------------
 * Serial Input has to accept the chars received from the underlying UART.
 * It has the ability to stop the data when the input fifo is full. This is
 * not very realistic because only UARTS with flow control enabled wait when
 * fifo is full. But timing isn't good enough currently to guarantee that
 * the cpu runs enough Cycles to empty the RX-Fifo. 
 * --------------------------------------------------------------------------------
 */

static void
serial_input(void *cd, UartChar c)
{
	IMX_Uart *iuart = cd;
	int fifocount;
	int room;
	serial_rx_char(iuart, c);
	room = RX_FIFO_ROOM(iuart);
	if (room < 1) {
		SerialDevice_StopRx(iuart->port);
	}
	update_rxdma(iuart);
	fifocount = RX_FIFO_COUNT(iuart);
	if (fifocount) {
		update_interrupts(iuart);
	}
	return;
}

/*
 * --------------------------------------------------------------------------------
 * Serial output is called whenever the underlying UART backend is able
 * to accept one or more chars. If serial output has no data for sending
 * (TX fifo is empty). Then the backend has to be stopped because the
 * Event handler for fetching more data should not be invoked anymore. 
 * --------------------------------------------------------------------------------
 */
static bool
serial_output(void *cd, UartChar * c)
{
	IMX_Uart *iuart = cd;
	if (TX_FIFO_RELEASED(iuart) > 0) {
		*c = iuart->txfifo[TX_FIFO_RIDX(iuart)];
		iuart->txfifo_rp = iuart->txfifo_rp + 1;
		update_txdma(iuart);
	} else {
		fprintf(stderr, "Bug in %s %s\n", __FILE__, __func__);
	}
	if (TX_FIFO_RELEASED(iuart) == 0) {
		SerialDevice_StopTx(iuart->port);
	}
	update_interrupts(iuart);
	return true;
}

static void
update_rx(IMX_Uart * iuart)
{
	if (iuart->ucr2 & UCR2_RXEN) {
		int room = RX_FIFO_ROOM(iuart);
		if (room > 0) {
			if (!(iuart->ucr3 & UCR3_RXDMUXSEL)) {
				fprintf(stderr, "Driver bug, starting rx with DMUXSEL 0\n");
			} else {
				SerialDevice_StartRx(iuart->port);
			}
		}
	} else {
		SerialDevice_StopRx(iuart->port);
	}
}

/*
 * ------------------------------------------------------------------
 * This releases a char in the txfifo for beeing sent
 * ------------------------------------------------------------------
 */
static void
IUart_ReleaseChar(void *clientData)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	if (iuart->txfifo_releasep < iuart->txfifo_wp) {
		iuart->txfifo_releasep++;
		SerialDevice_StartTx(iuart->port);
	}
	if (iuart->txfifo_releasep < iuart->txfifo_wp) {
		CycleTimer_Mod(&iuart->baudTimer, NanosecondsToCycles(iuart->nsecs_per_char));
	}
}

static uint32_t
urr_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	uint16_t urr = iuart->rxfifo[RX_FIFO_RIDX(iuart)];
	int count = RX_FIFO_COUNT(iuart);
	//fprintf(stderr,"URR rxfifo count %lld\n",RX_FIFO_COUNT(iuart));
	if (count > 0) {
		iuart->rxfifo_rp++;
		update_interrupts(iuart);
		update_rxdma(iuart);
		/* Maybe rx was stopped because fifo was full, so reenable it */
		if ((count == RX_FIFO_SIZE)) {
			update_rx(iuart);
		}
	} else {
		urr = urr & ~URR_CHARRDY;
	}
	return urr;
}

static void
urr_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	fprintf(stderr, "IMX: Uart receiver register not writable\n");
	return;
}

