zihui89w/leigun/modules/softgun/controllers/nuc970/nuc970_uart.c
/*
 * --------------------------------------------------
 * Reading Uart Transmitter register returns 0 
 * --------------------------------------------------
 */
static uint32_t
utr_read(void *clientData, uint32_t address, int rqlen)
{
	return 0;
}

static void
utr_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	if (TX_FIFO_ROOM(iuart) < 1) {
		fprintf(stderr, "NUC970-Uart TX-Fifo overflow (%08x)\n", value);
		return;
	}
	iuart->txfifo[TX_FIFO_WIDX(iuart)] = value;
	iuart->txfifo_wp += 1;
    
	//if (iuart->ucr2 & UCR2_TXEN) {
		if (!CycleTimer_IsActive(&iuart->baudTimer)) {
			CycleTimer_Mod(&iuart->baudTimer,
				       NanosecondsToCycles(iuart->nsecs_per_char));
		}
	//} else {
	//	fprintf(stderr, "i.MX21 UART: Writing to TX register of %s while disabled\n",
	//		iuart->name);
	//}
    
	update_interrupts(iuart);
	update_txdma(iuart);
	return;
}

static uint32_t
ucr1_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->ucr1;
}

static void
ucr1_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	iuart->ucr1 = value & 0xfffd;
	update_interrupts(iuart);
	return;
}

static uint32_t
ucr2_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->ucr2;
}

static void
ucr2_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	uint16_t diff = iuart->ucr2 ^ value;
	UartCmd cmd;
	iuart->ucr2 = value | UCR2_SRST;
	if (diff & UCR2_TXEN) {
		if (value & UCR2_TXEN) {
			if (!CycleTimer_IsActive(&iuart->baudTimer)) {
				CycleTimer_Mod(&iuart->baudTimer,
					       NanosecondsToCycles(iuart->nsecs_per_char));
			}
		} else {
			CycleTimer_Remove(&iuart->baudTimer);
		}
	}
	if (diff & UCR2_RXEN) {
		update_rx(iuart);
	}
	if (!(value & UCR2_SRST)) {
		iuart->txfifo_wp = iuart->txfifo_rp = 0;
		iuart->txfifo_releasep = 0;
		iuart->rxfifo_wp = iuart->rxfifo_rp = 0;
		iuart->usr1 = USR1_RXDS | USR1_TRDY;
		iuart->usr2 = USR2_TXFE | USR2_TXDC;
	}
	if (iuart->ucr2 & UCR2_CTSC) {
		cmd.opcode = UART_OPC_CRTSCTS;
		cmd.arg = 1;
		SerialDevice_Cmd(iuart->port, &cmd);
	} else {
		cmd.opcode = UART_OPC_CRTSCTS;
		cmd.arg = 0;
		SerialDevice_Cmd(iuart->port, &cmd);

		cmd.opcode = UART_OPC_SET_RTS;
		if (iuart->ucr2 & UCR2_CTS) {
			cmd.arg = UART_RTS_ACT;
		} else {
			cmd.arg = UART_RTS_INACT;
		}
		SerialDevice_Cmd(iuart->port, &cmd);
	}
	cmd.opcode = UART_OPC_PAREN;
	if (iuart->ucr2 & UCR2_PREN) {
		cmd.arg = 1;
	} else {
		cmd.arg = 0;
	}
	SerialDevice_Cmd(iuart->port, &cmd);

	cmd.opcode = UART_OPC_PARODD;
	if (iuart->ucr2 & UCR2_PROE) {
		cmd.arg = 1;
	} else {
		cmd.arg = 0;
	}
	SerialDevice_Cmd(iuart->port, &cmd);

	cmd.opcode = UART_OPC_SET_CSIZE;
	if (iuart->ucr2 & UCR2_WS) {
		cmd.arg = 8;
	} else {
		cmd.arg = 7;
	}
	SerialDevice_Cmd(iuart->port, &cmd);
	return;
}

static uint32_t
ucr3_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->ucr3;
}

static void
ucr3_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	uint32_t diff = value ^ iuart->ucr3;
	iuart->ucr3 = value;
	if ((diff & UCR3_RXDMUXSEL)) {
		update_rx(iuart);
	}
	return;
}

static uint32_t
ucr4_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->ucr4;
}

static void
ucr4_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	iuart->ucr4 = value;
	return;
}

static uint32_t
ufcr_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->ufcr;
}

static void
ufcr_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	iuart->ufcr = value & 0xffff;
	update_interrupts(iuart);
	update_refclk(iuart);
	return;
}

static uint32_t
usr1_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	UartCmd cmd;
	int tx_room = TX_FIFO_ROOM(iuart);
	int rx_fill = RX_FIFO_COUNT(iuart);
	int txtl = (iuart->ufcr & UFCR_TXTL_MASK) >> UFCR_TXTL_SHIFT;
	int rxtl = (iuart->ufcr & UFCR_RXTL_MASK) >> UFCR_RXTL_SHIFT;
	uint16_t usr1 = iuart->usr1;
	uint16_t diff;

	if (tx_room >= txtl) {
		usr1 |= USR1_TRDY;
	} else {
		usr1 &= ~USR1_TRDY;
	}
	if (rx_fill >= rxtl) {
		usr1 &= ~USR1_RRDY;
	} else {
		usr1 |= USR1_RRDY;
	}
	cmd.opcode = UART_OPC_GET_CTS;
	SerialDevice_Cmd(iuart->port, &cmd);
	if (cmd.retval) {
		usr1 |= USR1_RTSS;
	}
	diff = usr1 ^ iuart->usr1;
	if (diff & USR1_RTSS) {
		usr1 |= USR1_RTSD;
	}
	iuart->usr1 = usr1;
	return usr1;
}

static void
usr1_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	uint16_t clearmask = value & 0x9d30;
	iuart->usr1 &= ~clearmask;
	return;
}

static uint32_t
usr2_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	uint16_t diff;
	uint16_t usr2 = iuart->usr2;
	int rx_fill = RX_FIFO_COUNT(iuart);
	int tx_fill = TX_FIFO_COUNT(iuart);
	UartCmd cmd;

	if (rx_fill > 0) {
		usr2 |= USR2_RDR;
	} else {
		usr2 &= ~USR2_RDR;
	}
	if (tx_fill > 0) {
		//fprintf(stderr,"Not empty\n");
		usr2 &= ~(USR2_TXFE | USR2_TXDC);
	} else {
		usr2 |= USR2_TXFE | USR2_TXDC;
	}

	cmd.opcode = UART_OPC_GET_RI;
	SerialDevice_Cmd(iuart->port, &cmd);
	if (cmd.retval) {
		usr2 |= USR2_RIIN;
	}
	cmd.opcode = UART_OPC_GET_DCD;
	SerialDevice_Cmd(iuart->port, &cmd);
	if (cmd.retval) {
		usr2 |= USR2_DCDIN;
	}

	diff = usr2 ^ iuart->usr2;
	if (diff & USR2_RIIN) {
		usr2 |= USR2_RIDELT;
	}
	if (diff & USR2_DCDIN) {
		usr2 |= USR2_DCDDELT;
	}
	iuart->usr2 = usr2;
	if (!(usr2 & USR2_TXFE) || (~usr2 & USR2_RDR)) {
		Senseless_Report(150);
	}
	return iuart->usr2;
}

static void
usr2_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	int clearmask = value & 0xbdf6;	// Is ring indicator writable  ????
	iuart->usr2 &= ~clearmask;
	return;
}

