zihui89w/leigun/modules/softgun/controllers/nuc970/nuc970_uart.c
/*
 * -------------------------------
 * Escape: No functionality
 * -------------------------------
 */
static uint32_t
uesc_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->uesc;
}

static void
uesc_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	iuart->uesc = value & 0xff;
	return;
}

static uint32_t
utim_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->utim;
}

static void
utim_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	iuart->utim = value & 0xfff;
	return;
}

static uint32_t
ubir_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->ubir;
}

static void
ubir_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	//fprintf(stderr,"UBIR write %d\n",iuart->ubir);
	iuart->ubir = value & 0xffff;
	return;
}

static uint32_t
ubmr_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->ubmr;
}

static void
ubmr_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	int baudrate;
	UartCmd cmd;
	iuart->ubmr = value & 0xffff;
	baudrate = 1.0 * (iuart->ubir + 1)
	    * Clock_Freq(iuart->refclk) / (iuart->ubmr + 1) / 16;
	cmd.opcode = UART_OPC_SET_BAUDRATE;
	cmd.arg = baudrate;
	SerialDevice_Cmd(iuart->port, &cmd);
	if (baudrate) {
		int nsecs = 10000000000LL / baudrate;
		if ((nsecs > 5000) && (iuart->nsecs_per_char != nsecs)) {
			iuart->nsecs_per_char = nsecs;
			if (CycleTimer_IsActive(&iuart->baudTimer)) {
				CycleTimer_Mod(&iuart->baudTimer,
					       NanosecondsToCycles(iuart->nsecs_per_char));
			}
		}
	}
	return;
}

static uint32_t
ubrc_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->ubrc;
}

static void
ubrc_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	iuart->ubrc = value;
	return;
}

static uint32_t
onems_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	return iuart->onems;
}

static void
onems_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	iuart->onems = value;
	return;
}

static uint32_t
uts_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	int rx_fill = RX_FIFO_COUNT(iuart);
	int tx_fill = TX_FIFO_COUNT(iuart);
	int rx_room = RX_FIFO_ROOM(iuart);
	int tx_room = TX_FIFO_ROOM(iuart);
	if (rx_fill > 0) {
		iuart->uts &= ~UTS_RXEMPTY;
	} else {
		iuart->uts |= UTS_RXEMPTY;
	}
	if (tx_fill > 0) {
		iuart->uts &= ~UTS_TXEMPTY;
	} else {
		iuart->uts |= UTS_TXEMPTY;
	}
	if (rx_room > 0) {
		iuart->uts &= ~UTS_RXFULL;
	} else {
		iuart->uts |= UTS_RXFULL;
	}
	if (tx_room > 0) {
		iuart->uts &= ~UTS_TXFULL;
	} else {
		iuart->uts |= UTS_TXFULL;
	}
	//fprintf(stderr,"rx_room %d tx_room %d,rx_fill %d tx_fill %d uts %08x\n",rx_room,tx_room,rx_fill,tx_fill,iuart->uts);
	if (!(iuart->uts & UTS_TXEMPTY) || (iuart->uts & UTS_RXEMPTY)) {
		Senseless_Report(100);
	}
	return iuart->uts;
}

static void
uts_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Uart *iuart = (IMX_Uart *) clientData;
	iuart->uts = (iuart->uts & ~0x3e00) | (value & 0x3e00);
	return;

}

static uint32_t
undefined_read(void *clientData, uint32_t address, int rqlen)
{
	fprintf(stderr, "WARNING !: read from undefined location 0x%08x in i.MX21 UART module\n",
		address);
	return 0;
}

static void
undefined_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	fprintf(stderr, "WARNING !: write to undefined location 0x%08x in i.MX21 UART module\n",
		address);
	return;
}

static uint32_t UA_FCR_read(void *clientData, uint32_t address, int rqlen)
{
    return 0;
}

static void UA_FCR_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{

}

static uint32_t UA_LCR_read(void *clientData, uint32_t address, int rqlen)
{
    return 0;
}

static void UA_LCR_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{

}

static uint32_t UA_BAUD_read(void *clientData, uint32_t address, int rqlen)
{
    return 0;
}

static void UA_BAUD_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
    IMX_Uart *iuart = (IMX_Uart *) clientData;
    /* 
    [31:30] Reserved    Reserved.
    [29]    DIV_X_EN    Divider X Enable Control
        0 = Divider X Disabled (the equation of M = 16).
        1 = Divider X Enabled (the equation of M = X+1, but DIVIDER_X(UA_BAUD[27:24]) must
            >= 8).
        Refer to the table below for more information.
        Note: In IrDA mode, this bit must disable.
        Note: The BRD = Baud Rate Divider, and the baud rate equation is
        Baud Rate = Clock / [M * (BRD + 2)]; The default value of M is 16.
    [28]    DIV_X_ONE   Divider X Equal to 1
        0 = Divider M = X (the equation of M = X+1, but DIVIDER_X(UA_BAUD[27:24]) must >=
        8).
        1 = Divider M = 1 (the equation of M = 1, but BRD(UA_BAUD[15:0]) must >= 3).
    [27:24] DIVIDER_X   Divider X
        The baud rate divider M = X+1.
    [23:16] Reserved    Reserved.
    [15:0]  BRD         Baud Rate Divider
        The field indicated the baud rate divider

     * The baud rate equation is: Baud Rate = UART_CLK / M * [BRD + 2]
     * where M and BRD are defined in Baud Rate Divider Register (UA_BAUD).
     *   Mode DIV_X_EN DIV_X_ONE DIVIDER X  BRD Baud Rate Equation
     *   0    Disable  0         Don’t Care A   UART_CLK / [16 * (A+2)]
     *   1    Enable   0         B          A   UART_CLK / [(B+1) * (A+2)] , B must >= 8
     *   2    Enable   1         Don’t care A   UART_CLK / (A+2), A must >=9
     */
    uint32_t xEn = (value >> 29) & 0x1;
    uint32_t xOne = (value >> 28) & 0x1;
    uint32_t divX = (value >> 24) & 0xf;
    uint32_t brd = value & 0xffff;
    uint32_t m = 1;
    if (!xEn)
        m = 16;
    else if (!xOne)
        m = divX + 1;
    
    int baudrate = 12000000 / (m * (brd + 2)); 

