zihui89w/leigun/modules/softgun/controllers/nuc970/nuc970_uart.c
    fprintf(stderr, "[%s] Clock In: %d, Ref: %d\n", iuart->name, 
        Clock_Freq(iuart->in_clk), 
        Clock_Freq(iuart->refclk));
    fprintf(stderr, "Setting [%s] Baud Rate to %d [%08x]\n", iuart->name, baudrate, value);
    
	UartCmd cmd;
	//baudrate = 1.0 * (iuart->ubir + 1)
	//    * Clock_Freq(iuart->refclk) / (iuart->ubmr + 1) / 16;
	cmd.opcode = UART_OPC_SET_BAUDRATE;
	cmd.arg = baudrate;
	SerialDevice_Cmd(iuart->port, &cmd);
	if (baudrate) {
		int nsecs = 10000000000LL / baudrate;
		if ((nsecs > 5000) && (iuart->nsecs_per_char != nsecs)) {
			iuart->nsecs_per_char = nsecs;
			if (CycleTimer_IsActive(&iuart->baudTimer)) {
				CycleTimer_Mod(&iuart->baudTimer,
					       NanosecondsToCycles(iuart->nsecs_per_char));
			}
		}
	}
    return;
}

static void
IMXUart_Map(void *owner, uint32_t base, uint32_t mask, uint32_t flags)
{
	IMX_Uart *iuart = owner;
	/* Partial read: Read all return part, Partial Write: Read modify write */
	uint32_t mapflags = IOH_FLG_PRD_RARP | IOH_FLG_PWR_RMW | IOH_FLG_HOST_ENDIAN;
	
    IOH_New32f(URR(base), urr_read, utr_write, iuart, mapflags);

    IOH_New32f(base + 0x08, UA_FCR_read, UA_FCR_write, iuart, mapflags);
    IOH_New32f(base + 0x0c, UA_LCR_read, UA_LCR_write, iuart, mapflags);
    IOH_New32f(base + 0x24, UA_BAUD_read, UA_BAUD_write, iuart, mapflags);

	//IOH_New32f(UTR(base), utr_read, utr_write, iuart, mapflags);
	IOH_New32f(UCR1(base), ucr1_read, ucr1_write, iuart, mapflags);
	IOH_New32f(UCR2(base), ucr2_read, ucr2_write, iuart, mapflags);
	IOH_New32f(UCR3(base), ucr3_read, ucr3_write, iuart, mapflags);
	IOH_New32f(UCR4(base), ucr4_read, ucr4_write, iuart, mapflags);
	IOH_New32f(UFCR(base), ufcr_read, ufcr_write, iuart, mapflags);
	IOH_New32f(USR1(base), usr1_read, usr1_write, iuart, mapflags);
	IOH_New32f(USR2(base), usr2_read, usr2_write, iuart, mapflags);
	IOH_New32f(UESC(base), uesc_read, uesc_write, iuart, mapflags);
	IOH_New32f(UTIM(base), utim_read, utim_write, iuart, mapflags);
	IOH_New32f(UBIR(base), ubir_read, ubir_write, iuart, mapflags);
	IOH_New32f(UBMR(base), ubmr_read, ubmr_write, iuart, mapflags);
	IOH_New32f(UBRC(base), ubrc_read, ubrc_write, iuart, mapflags);
	IOH_New32f(ONEMS(base), onems_read, onems_write, iuart, mapflags);
	IOH_New32f(UTS(base), uts_read, uts_write, iuart, mapflags);



	
}

static void
IMXUart_UnMap(void *owner, uint32_t base, uint32_t mask)
{
	IOH_Delete32(URR(base));
	IOH_Delete32(UTR(base));
	IOH_Delete32(UCR1(base));
	IOH_Delete32(UCR2(base));
	IOH_Delete32(UCR3(base));
	IOH_Delete32(UCR4(base));
	IOH_Delete32(UFCR(base));
	IOH_Delete32(USR1(base));
	IOH_Delete32(USR2(base));
	IOH_Delete32(UESC(base));
	IOH_Delete32(UTIM(base));
	IOH_Delete32(UBIR(base));
	IOH_Delete32(UBMR(base));
	IOH_Delete32(UBRC(base));
	IOH_Delete32(ONEMS(base));
	IOH_Delete32(UTS(base));
	

}

BusDevice *
NUC970Uart_New(const char *name)
{
	IMX_Uart *iuart = sg_new(IMX_Uart);
	iuart->irqNode = SigNode_New("%s.irq", name);
	iuart->rxDmaReqNode = SigNode_New("%s.rx_dmareq", name);
	iuart->txDmaReqNode = SigNode_New("%s.tx_dmareq", name);
	if (!iuart->irqNode || !iuart->rxDmaReqNode || !iuart->txDmaReqNode) {
		fprintf(stderr, "NUC970Uart: Can not create uart signal lines\n");
	}
	iuart->usr1 = USR1_RXDS | USR1_TRDY;
	iuart->usr2 = USR2_TXFE | USR2_TXDC;
	iuart->ucr2 = UCR2_SRST;
	/* Make it nonworking when user forgets to reset the fifo */
	iuart->rxfifo_rp = 0;// 0x1000000;
	iuart->ufcr = 0x00000801;
	iuart->bdev.first_mapping = NULL;
	iuart->bdev.Map = IMXUart_Map;
	iuart->bdev.UnMap = IMXUart_UnMap;
	iuart->bdev.owner = iuart;
	iuart->bdev.hw_flags = MEM_FLAG_WRITABLE | MEM_FLAG_READABLE;
	iuart->name = sg_strdup(name);
	iuart->port = Uart_New(name, serial_input, serial_output, NULL, iuart);
	iuart->in_clk = Clock_New("%s.clk", name);
	iuart->nsecs_per_char = 1000000;
	CycleTimer_Init(&iuart->baudTimer, IUart_ReleaseChar, iuart);

	/* Clock should come from perclk1 of CRM module */

	iuart->refclk = Clock_New("%s.refclk", name);
	update_refclk(iuart);
	update_interrupts(iuart);
	fprintf(stderr, "NUC970 Uart \"%s\" created\n", name);
	return &iuart->bdev;
}
